
#define BIG_ENDIAN_F1H	0
#define BIG_ENDIAN_FFH 0 
#define BIG_ENDIAN_1F0H 0 
#define BIG_ENDIAN_1F1H 0 
#define BIG_ENDIAN_1F2H 0 
#define BIG_ENDIAN_80H 0 
#define BIG_ENDIAN_81H 0

typedef struct 
{ 
#if BIG_ENDIAN_F1H 
	BYTE line_id_h;			// 1   线路号 高字节 
	BYTE line_id_l;		    // 2
	BYTE train_id_1;		// 3   列车号 
	BYTE train_id_2;		// 4
	BYTE train_id_3; 		// 5
	BYTE car_id; 		    // 6
	BYTE reserve1; 			// 7
	BYTE reserve2; 			// 8
#else //小端
	BYTE line_id_l;		    // 2
	BYTE line_id_h;			// 1   线路号 高字节 	
	BYTE train_id_2;		// 3   列车号 
	BYTE train_id_1;		// 4
	BYTE reserve[4]; 		// 5-8 
#endif 
}CAR_ID_F1H_T;	//车号

typedef struct 
{ 
#if BIG_ENDIAN_FFH 
	BYTE year;			// 1   
	BYTE month;			// 2 
	BYTE date;			// 3 
	BYTE hour;			// 4 
	BYTE minute;		// 5 
	BYTE second;		// 6 
	BYTE time_valid;    // 7
	BYTE reserve1;      // 8
	BYTE reserve2[8];   // 9-16
#else 
	BYTE month;      // 2 
	BYTE year;      // 1   
	BYTE hour;      // 4 
	BYTE date;      // 3 
	BYTE second;      // 6 
	BYTE minute;      // 5 
	struct
	{
		BYTE Date_Time_Valid:1;	//严重故障
		BYTE res:7;
	}DateTimeValid_t;
	BYTE reserve;	
#endif 
}TIME_FFH_T;	//时间



typedef struct
{
#if BIG_ENDIAN_1F0H
	struct
	{
		BYTE ATC1_Serious_fault:1;	//严重故障
		BYTE ATC1_Medium_fault:1;
		BYTE res:1;
		BYTE CBTC_MODE:1;
		BYTE res:4;
	}fault_valid_t;
	BYTE res1;
	BYTE res2[6];
#else
	BYTE res;	//1
	struct
	{
		BYTE ATC1_Serious_fault:1;	//严重故障
		BYTE ATC1_Medium_fault:1;
		BYTE res:1;
		BYTE CBTC_MODE:1;
		BYTE res1:4;
	}fault_valid_t;	//2
	BYTE res2[6];	//8
#endif
}ATC_1F0H_T;	//ATC故障

typedef struct
{
#if BIG_ENDIAN_1F1H
	struct 
	{
		BYTE ATC1_ATO_active:1; //ATO模式激活
		BYTE ATC1_ATB_mode:1;
		BYTE ATC1_Prot_Manual_mode:1;
		BYTE ATC1_Rest_Manual_mode:1;
		BYTE ATC1_ATP_Reverse_mode:1;
		BYTE ATC1_Drive_command:1;
		BYTE ATC1_Brake_command:1;
		BYTE ATC1_Emergency_brake:1;
	}mode_info_t;
	struct
	{
		BYTE res1:2;
		BYTE ATC1_Drive_br_setp_valid:1; //牵引/制动参考值有效
		BYTE ATC1_Open_doors_side_A:1;
		BYTE ATC1_Open_doors_side_B:1;
		BYTE ATC1_Close_doors_side_A:1;
		BYTE ATC1_Close_doors_side_B:1;
		BYTE res2:1;
	}door_info_t;
	BYTE res3[2];
	BYTE ATC1_Drive_brake_setpoint_h;
	BYTE ATC1_Drive_brake_setpoint_l;
	BYTE res4[2];
#else
	struct
	{
		BYTE res1:2;
		BYTE ATC1_Drive_br_setp_valid:1; //牵引/制动参考值有效
		BYTE ATC1_Open_doors_side_A:1;
		BYTE ATC1_Open_doors_side_B:1;
		BYTE ATC1_Close_doors_side_A:1;
		BYTE ATC1_Close_doors_side_B:1;
		BYTE res2:1;
	}door_info_t;	//1
	struct 
	{
		BYTE ATC1_ATO_active:1; //ATO模式激活
		BYTE ATC1_ATB_mode:1;
		BYTE ATC1_Prot_Manual_mode:1;
		BYTE ATC1_Rest_Manual_mode:1;
		BYTE ATC1_ATP_Reverse_mode:1;
		BYTE ATC1_Drive_command:1;
		BYTE ATC1_Brake_command:1;
		BYTE ATC1_Emergency_brake:1;
	}mode_info_t;	//2
	BYTE res3[2];	//4
	BYTE ATC1_Drive_brake_setpoint_l;	//5
	BYTE ATC1_Drive_brake_setpoint_h;	//6
	BYTE res4[2];	//8
#endif
}ATC_1F1H_T;	//ATC快速

typedef struct
{
#if BIG_ENDIAN_1F2H
	BYTE ATC1_Time_year;
	BYTE ATC1_Time_Mon;	//ATC时钟-月
	BYTE ATC1_Time_Day;
	BYTE ATC1_Time_Hour;
	BYTE ATC1_Time_Min;
	BYTE ATC1_Time_Sec;
	struct
	{
		BYTE ATC1_Open_B_side_next:1;//下一站将打开B侧车门
		BYTE ATC1_Open_A_side_next:1;
		BYTE res1:6;
	}open_info_t;
	BYTE res2;
	BYTE ATC1_Train_number_h;
	BYTE ATC1_Train_number_l;
	BYTE ATC1_Current_velocity_h;
	BYTE ATC1_Current_velocity_l;
	BYTE ATC1_End_station_ID_h;
	BYTE ATC1_End_station_ID_l;
	BYTE ATC1_Current_station_ID_h;
	BYTE ATC1_Current_station_ID_l;
	BYTE ATC1_Next_station_ID_h;
	BYTE ATC1_Next_station_ID_l;
	BYTE ATC1_Location_info_h;
	BYTE ATC1_Location_info_l;	//20
	BYTE res3[4];
	BYTE ATC1_Heartbeat_h;
	BYTE ATC1_Heartbeat_l;
	BYTE res4[6];
#else
	BYTE ATC1_Time_Mon;	//ATC时钟-月
	BYTE ATC1_Time_year;
	BYTE ATC1_Time_Hour;
	BYTE ATC1_Time_Day;
	BYTE ATC1_Time_Sec;
	BYTE ATC1_Time_Min;
	BYTE res2;	//7
	struct
	{
		BYTE ATC1_Open_B_side_next:1;//下一站将打开B侧车门
		BYTE ATC1_Open_A_side_next:1;
		BYTE res1:6;
	}open_info_t;	//8
	BYTE ATC1_Train_number_l;
	BYTE ATC1_Train_number_h;
	BYTE ATC1_Current_velocity_l;
	BYTE ATC1_Current_velocity_h;
	BYTE ATC1_End_station_ID_l;
	BYTE ATC1_End_station_ID_h;
	BYTE ATC1_Current_station_ID_l;
	BYTE ATC1_Current_station_ID_h;
	BYTE ATC1_Next_station_ID_l;
	BYTE ATC1_Next_station_ID_h;
	BYTE ATC1_Location_info_l;
	BYTE ATC1_Location_info_h;//20
	BYTE res3[4];
	BYTE ATC1_Heartbeat_l;
	BYTE ATC1_Heartbeat_h;
	BYTE res4[6];
#endif
}ATC_1F2H_T;	//ATC慢速

typedef struct
{
#if BIG_ENDIAN_80H
	struct
	{
		BYTE Cbk_Left_all_doors_closed:1;	//列车左门已关好
		BYTE Cbk_Right_all_doors_closed:1;
		BYTE ATO_ATP_mode_active:1;
		BYTE PM_mode_active:1;
		BYTE res1:2;
		BYTE Manual_station_ann_leave:1;
		BYTE Manual_station_ann_arrive:1;
	}cbk_info_t;
	struct
	{
		BYTE Cab_manned_Tc1:1;
		BYTE Cab_manned_Tc2:1;
		BYTE Electrical_coupled_Tc1:1;
		BYTE Electrical_coupled_Tc2:1;
		BYTE open_Left_door:1;
		BYTE open_right_door:1;
		BYTE close_Left_door:1;
		BYTE close_right_door:1;
	}cab_info_t;
	BYTE res2;
	struct
	{
		BYTE Emergency_announcement_touch:1;
		BYTE res3:1;
		BYTE Announcement_Mode_ATC:1;
		BYTE Announcement_Mode_TCMS:1;
		BYTE Jump_station_up:1;
		BYTE Jump_station_down:1;
		BYTE Route_map_open:1;
		BYTE Route_map_close:1;
	}Emergency_info_t;
	BYTE Emergency_announcement_ID_h;
	BYTE Emergency_announcement_ID_l;
	BYTE HMI_start_ID_h;
	BYTE HMI_start_ID_l;
	BYTE HMI_next_ID_h;
	BYTE HMI_next_ID_l;
	BYTE HMI_end_ID_h;
	BYTE HMI_end_ID_l;
	BYTE HMI_Line_ID_h;
	BYTE HMI_Line_ID_l;
	BYTE HMI_Route_ID_h;
	BYTE HMI_Route_ID_l;
	BYTE Ref_Velocity_h;
	BYTE Ref_Velocity_l;
	BYTE VCM_Life_h;
	BYTE VCM_Life_l;
	BYTE Car1_Temp_h;
	BYTE Car1_Temp_l;
	BYTE Car2_Temp_h;
	BYTE Car2_Temp_l;
	BYTE Car3_Temp_h;
	BYTE Car3_Temp_l;
	BYTE Car4_Temp_h;
	BYTE Car4_Temp_l;
	BYTE Car5_Temp_h;
	BYTE Car5_Temp_l;
	BYTE Car6_Temp_h;
	BYTE Car6_Temp_l;
#else
	struct
	{
		BYTE Cab_manned_Tc1			:	1;	//Tc1端司机室占有
		BYTE Cab_manned_Tc2			:	1;
		BYTE Electrical_coupled_Tc1	:	1;
		BYTE Electrical_coupled_Tc2	:	1;
		BYTE open_Left_door			:	1;
		BYTE open_right_door		:	1;
		BYTE close_Left_door		:	1;
		BYTE close_right_door		:	1;
	}cab_info_t;						//1
	struct
	{
		BYTE Cbk_Left_all_doors_closed		:	1;	//列车左门已关好
		BYTE Cbk_Right_all_doors_closed		:	1;
		BYTE ATO_ATP_mode_active			:	1;
		BYTE PM_mode_active					:	1;
		BYTE res1							:	2;
		BYTE Manual_station_ann_leave		:	1;
		BYTE Manual_station_ann_arrive		:	1;
	}cbk_info_t;					    //2
	struct
	{
		BYTE Emergency_announcement_touch	:	1;
		BYTE res3							:	1;
		BYTE Announcement_Mode_ATC			:	1;
		BYTE Announcement_Mode_TCMS			:	1;
		BYTE Jump_station_up				:	1;
		BYTE Jump_station_down				:	1;
		BYTE Route_map_open					:	1;
		BYTE Route_map_close				:	1;
	}Emergency_info_t;				   //3
	BYTE res2;						   //4
	BYTE Emergency_announcement_ID_l;
	BYTE Emergency_announcement_ID_h;
	BYTE HMI_start_ID_l;
	BYTE HMI_start_ID_h;
	BYTE HMI_next_ID_l;
	BYTE HMI_next_ID_h;				   //10
	BYTE HMI_end_ID_l;
	BYTE HMI_end_ID_h;
	BYTE HMI_Line_ID_l;
	BYTE HMI_Line_ID_h;
	BYTE HMI_Route_ID_l;
	BYTE HMI_Route_ID_h;
	BYTE Ref_Velocity_l;
	BYTE Ref_Velocity_h;			   //18
	BYTE VCM_Life_l;
	BYTE VCM_Life_h;
	BYTE Car1_Temp_l;
	BYTE Car1_Temp_h;
	BYTE Car2_Temp_l;
	BYTE Car2_Temp_h;
	BYTE Car3_Temp_l;
	BYTE Car3_Temp_h;				   //26
	BYTE Car4_Temp_l;
	BYTE Car4_Temp_h;
	BYTE Car5_Temp_l;
	BYTE Car5_Temp_h;
	BYTE Car6_Temp_l;
	BYTE Car6_Temp_h;				   //32
#endif
}VCM_PA_80H;

typedef struct
{
#if BIG_ENDIAN_81H
	struct
	{
		BYTE Fire_alarm_1_1:1;
		BYTE Fire_alarm_2_1:1;
		BYTE Fire_alarm_3_1:1;
		BYTE Fire_alarm_4_1:1;
		BYTE Fire_alarm_5_1:1;
		BYTE res1:3;
	}fire_alarm1_t;
	struct
	{
		BYTE Door_emergency_release_1_1:1;
		BYTE Door_emergency_release_2_1:1;
		BYTE Door_emergency_release_3_1:1;
		BYTE Door_emergency_release_4_1:1;
		BYTE Door_emergency_release_5_1:1;
		BYTE Door_emergency_release_6_1:1;
		BYTE Door_emergency_release_7_1:1;
		BYTE Door_emergency_release_8_1:1;
	}door_emergency1_t;
	struct
	{
		BYTE Fire_alarm_1_2:1;
		BYTE Fire_alarm_2_2:1;
		BYTE Fire_alarm_3_2:1;
		BYTE Fire_alarm_4_2:1;
		BYTE Fire_alarm_5_2:1;
		BYTE res2:3;
	}fire_alarm2_t;
	struct
	{
		BYTE Door_emergency_release_1_2:1;
		BYTE Door_emergency_release_2_2:1;
		BYTE Door_emergency_release_3_2:1;
		BYTE Door_emergency_release_4_2:1;
		BYTE Door_emergency_release_5_2:1;
		BYTE Door_emergency_release_6_2:1;
		BYTE Door_emergency_release_7_2:1;
		BYTE Door_emergency_release_8_2:1;
	}door_emergency2_t;
	struct
	{
		BYTE Fire_alarm_1_3:1;
		BYTE Fire_alarm_2_3:1;
		BYTE Fire_alarm_3_3:1;
		BYTE Fire_alarm_4_3:1;
		BYTE Fire_alarm_5_3:1;
		BYTE res3:3;
	}fire_alarm3_t;
	struct
	{
		BYTE Door_emergency_release_1_3:1;
		BYTE Door_emergency_release_2_3:1;
		BYTE Door_emergency_release_3_3:1;
		BYTE Door_emergency_release_4_3:1;
		BYTE Door_emergency_release_5_3:1;
		BYTE Door_emergency_release_6_3:1;
		BYTE Door_emergency_release_7_3:1;
		BYTE Door_emergency_release_8_3:1;
	}door_emergency3_t;
	struct
	{
		BYTE Fire_alarm_1_4:1;
		BYTE Fire_alarm_2_4:1;
		BYTE Fire_alarm_3_4:1;
		BYTE Fire_alarm_4_4:1;
		BYTE Fire_alarm_5_4:1;
		BYTE res1:4;
	}fire_alarm4_t;
	struct
	{
		BYTE Door_emergency_release_1_4:1;
		BYTE Door_emergency_release_2_4:1;
		BYTE Door_emergency_release_3_4:1;
		BYTE Door_emergency_release_4_4:1;
		BYTE Door_emergency_release_5_4:1;
		BYTE Door_emergency_release_6_4:1;
		BYTE Door_emergency_release_7_4:1;
		BYTE Door_emergency_release_8_4:1;
	}door_emergency4_t;
	struct
	{
		BYTE Fire_alarm_1_5:1;
		BYTE Fire_alarm_2_5:1;
		BYTE Fire_alarm_3_5:1;
		BYTE Fire_alarm_4_5:1;
		BYTE Fire_alarm_5_5:1;
		BYTE res5:3;
	}fire_alarm5_t;
	struct
	{
		BYTE Door_emergency_release_1_5:1;
		BYTE Door_emergency_release_2_5:1;
		BYTE Door_emergency_release_3_5:1;
		BYTE Door_emergency_release_4_5:1;
		BYTE Door_emergency_release_5_5:1;
		BYTE Door_emergency_release_6_5:1;
		BYTE Door_emergency_release_7_5:1;
		BYTE Door_emergency_release_8_5:1;
	}door_emergency5_t;
	struct
	{
		BYTE Fire_alarm_1_6:1;
		BYTE Fire_alarm_2_6:1;
		BYTE Fire_alarm_3_6:1;
		BYTE Fire_alarm_4_6:1;
		BYTE Fire_alarm_5_6:1;
		BYTE res6:3;
	}fire_alarm6_t;
	struct
	{
		BYTE Door_emergency_release_1_6:1;
		BYTE Door_emergency_release_2_6:1;
		BYTE Door_emergency_release_3_6:1;
		BYTE Door_emergency_release_4_6:1;
		BYTE Door_emergency_release_5_6:1;
		BYTE Door_emergency_release_6_6:1;
		BYTE Door_emergency_release_7_6:1;
		BYTE Door_emergency_release_8_6:1;
	}door_emergency6_t;
	BYTE Media_host_volume_h;	//媒体主机音量
	BYTE Media_host_volume_l;
	BYTE res9[2];
#else
	struct
	{
		BYTE Door_emergency_release_1_1:1;	//1车1号门紧急解锁
		BYTE Door_emergency_release_2_1:1;
		BYTE Door_emergency_release_3_1:1;
		BYTE Door_emergency_release_4_1:1;
		BYTE Door_emergency_release_5_1:1;
		BYTE Door_emergency_release_6_1:1;
		BYTE Door_emergency_release_7_1:1;
		BYTE Door_emergency_release_8_1:1;
	}door_emergency1_t;	//1
	struct
	{
		BYTE Fire_alarm_1_1:1;
		BYTE Fire_alarm_2_1:1;
		BYTE Fire_alarm_3_1:1;
		BYTE Fire_alarm_4_1:1;
		BYTE Fire_alarm_5_1:1;
		BYTE res1:3;
	}fire_alarm1_t;	//2
	struct
	{
		BYTE Door_emergency_release_1_2:1;
		BYTE Door_emergency_release_2_2:1;
		BYTE Door_emergency_release_3_2:1;
		BYTE Door_emergency_release_4_2:1;
		BYTE Door_emergency_release_5_2:1;
		BYTE Door_emergency_release_6_2:1;
		BYTE Door_emergency_release_7_2:1;
		BYTE Door_emergency_release_8_2:1;
	}door_emergency2_t;
	struct
	{
		BYTE Fire_alarm_1_2:1;
		BYTE Fire_alarm_2_2:1;
		BYTE Fire_alarm_3_2:1;
		BYTE Fire_alarm_4_2:1;
		BYTE Fire_alarm_5_2:1;
		BYTE res2:3;
	}fire_alarm2_t;	//4
	struct
	{
		BYTE Door_emergency_release_1_3:1;
		BYTE Door_emergency_release_2_3:1;
		BYTE Door_emergency_release_3_3:1;
		BYTE Door_emergency_release_4_3:1;
		BYTE Door_emergency_release_5_3:1;
		BYTE Door_emergency_release_6_3:1;
		BYTE Door_emergency_release_7_3:1;
		BYTE Door_emergency_release_8_3:1;
	}door_emergency3_t;
	struct
	{
		BYTE Fire_alarm_1_3:1;
		BYTE Fire_alarm_2_3:1;
		BYTE Fire_alarm_3_3:1;
		BYTE Fire_alarm_4_3:1;
		BYTE Fire_alarm_5_3:1;
		BYTE res3:3;
	}fire_alarm3_t;	//6
	struct
	{
		BYTE Door_emergency_release_1_4:1;
		BYTE Door_emergency_release_2_4:1;
		BYTE Door_emergency_release_3_4:1;
		BYTE Door_emergency_release_4_4:1;
		BYTE Door_emergency_release_5_4:1;
		BYTE Door_emergency_release_6_4:1;
		BYTE Door_emergency_release_7_4:1;
		BYTE Door_emergency_release_8_4:1;
	}door_emergency4_t;
	struct
	{
		BYTE Fire_alarm_1_4:1;
		BYTE Fire_alarm_2_4:1;
		BYTE Fire_alarm_3_4:1;
		BYTE Fire_alarm_4_4:1;
		BYTE Fire_alarm_5_4:1;
		BYTE res1:3;
	}fire_alarm4_t;	//8
	struct
	{
		BYTE Door_emergency_release_1_5:1;
		BYTE Door_emergency_release_2_5:1;
		BYTE Door_emergency_release_3_5:1;
		BYTE Door_emergency_release_4_5:1;
		BYTE Door_emergency_release_5_5:1;
		BYTE Door_emergency_release_6_5:1;
		BYTE Door_emergency_release_7_5:1;
		BYTE Door_emergency_release_8_5:1;
	}door_emergency5_t;
	struct
	{
		BYTE Fire_alarm_1_5:1;
		BYTE Fire_alarm_2_5:1;
		BYTE Fire_alarm_3_5:1;
		BYTE Fire_alarm_4_5:1;
		BYTE Fire_alarm_5_5:1;
		BYTE res5:3;
	}fire_alarm5_t;	//10
	struct
	{
		BYTE Door_emergency_release_1_6:1;
		BYTE Door_emergency_release_2_6:1;
		BYTE Door_emergency_release_3_6:1;
		BYTE Door_emergency_release_4_6:1;
		BYTE Door_emergency_release_5_6:1;
		BYTE Door_emergency_release_6_6:1;
		BYTE Door_emergency_release_7_6:1;
		BYTE Door_emergency_release_8_6:1;
	}door_emergency6_t;
	struct
	{
		BYTE Fire_alarm_1_6:1;
		BYTE Fire_alarm_2_6:1;
		BYTE Fire_alarm_3_6:1;
		BYTE Fire_alarm_4_6:1;
		BYTE Fire_alarm_5_6:1;
		BYTE res6:3;
	}fire_alarm6_t;	//12
	BYTE Media_host_volume_l;	//媒体主机音量
	BYTE Media_host_volume_h;
	BYTE res9[2];	//16
#endif
}VCM_TV_81H;

typedef struct 
{ 
	BYTE fram_begin;   								// 0  0xFE

	/******车号端口 F1H  Len:8******/
	CAR_ID_F1H_T car_id_t;		   					// 1-8

	/******时间 FFH  Len:8******/
	TIME_FFH_T time_t; 								// 9-16

	/******ATC1故障数据 1F0H  Len:8******/			// 17-24
	ATC_1F0H_T atc_t;

	/******ATC1快速状态数据 1F1H  Len:8******/		// 25-32
	ATC_1F1H_T atc_t2;

	/******ATC1慢速状态数据 1F2H  Len:32******/		// 33-64
	ATC_1F2H_T atc_t3;

	/******VCM发给PIS_PA控制端口 80H  Len:32******/	// 65-96
	VCM_PA_80H vcm_t;

	/******VCM发给PIS_TV控制端口 81H  Len:16******/	// 97-112
	VCM_TV_81H vcm_t2;

	BYTE checksum;    								//  113
	BYTE fram_end;   								//  114  0xFF	
}tms_packet_t;


/*****************************PIS协议**************************************/
#define BIG_ENDAAN_180H 0
#define BIG_ENDIAN_181H 0 
#define BIG_ENDIAN_182H 0 

typedef struct
{
#if BIG_ENDAAN_180H
	BYTE res1;
	struct
	{
		BYTE Serious_fault:1;
		BYTE General_failure:1;
		BYTE Minor_fault:1;
		BYTE res2:5;
	}fault_level_t;
	struct
	{
		BYTE ACSU1:1;
		BYTE ACSU6:1;
		BYTE PACU1:1;
		BYTE PACU2:1;
		BYTE PACU3:1;
		BYTE PACU4:1;
		BYTE PACU5:1;
		BYTE PACU6:1;
	}comm_failt_t;
	struct
	{
		BYTE AC_1:1;
		BYTE AC_6:1;
		BYTE PA_1:1;
		BYTE PA_2:1;
		BYTE PA_3:1;
		BYTE PA_4:1;
		BYTE PA_5:1;
		BYTE PA_6:1;
	}cu_failt_t;
	struct
	{
		BYTE PECU_comm_1_3:1;	//3车PECU1通讯错误
		BYTE PECU_comm_2_3:1;
		BYTE PECU_comm_3_3:1;
		BYTE PECU_comm_4_3:1;
		BYTE res3:4;
	}car3_comm_error_t;
	struct
	{
		BYTE PECU_comm_1_1:1;
		BYTE PECU_comm_2_1:1;
		BYTE PECU_comm_3_1:1;
		BYTE PECU_comm_4_1:1;
		BYTE PECU_comm_1_2:1;
		BYTE PECU_comm_2_2:1;
		BYTE PECU_comm_3_2:1;
		BYTE PECU_comm_4_2:1;
	}car1_2_comm_error_t;
	struct
	{
		BYTE PECU_comm_1_4:1;	//4车PECU1通讯错误
		BYTE PECU_comm_2_4:1;
		BYTE PECU_comm_3_4:1;
		BYTE PECU_comm_4_4:1;
		BYTE res4:4;
	}car4_comm_error_t;
	struct
	{
		BYTE PECU_comm_1_6:1;
		BYTE PECU_comm_2_6:1;
		BYTE PECU_comm_3_6:1;
		BYTE PECU_comm_4_6:1;
		BYTE PECU_comm_1_5:1;
		BYTE PECU_comm_2_5:1;
		BYTE PECU_comm_3_5:1;
		BYTE PECU_comm_4_5:1;
	}car5_6_comm_error_t;
	BYTE res5[2];
	struct
	{
		BYTE res6[5];
		BYTE auto_mode:1;
		BYTE semi_auto_mode:1;
		BYTE manual_mode:1;
	}select_mode_t;
	struct
	{
		BYTE CRCK_Master:1;
		BYTE CRCK_Slave:1;
		BYTE PA_active:1;
		BYTE Cab_to_PA:1;
		BYTE Radio_to_PA:1;
		BYTE Cab_to_Cab:1;
		BYTE Drive_to_PECU:1;
		BYTE Emc_announce_activated:1;
	}acsu_info_t;
	struct
	{
		BYTE PECU_call1_3:1;	//3车PECU1呼叫
		BYTE PECU_call2_3:1;
		BYTE PECU_call3_3:1;
		BYTE PECU_call4_3:1;
		BYTE res7:4;
	}car3_pecu_call_t;
	struct
	{
		BYTE PECU_call1_1:1;
		BYTE PECU_call2_1:1;
		BYTE PECU_call3_1:1;
		BYTE PECU_call4_1:1;
		BYTE PECU_call1_2:1;
		BYTE PECU_call2_2:1;
		BYTE PECU_call3_2:1;
		BYTE PECU_call4_2:1;
	}car1_2_pecu_call_t;
	struct
	{
		BYTE PECU_call1_4:1;	//4车PECU1呼叫
		BYTE PECU_call2_4:1;
		BYTE PECU_call3_4:1;
		BYTE PECU_call4_4:1;
		BYTE res8:4;
	}car4_pecu_call_t;
	struct
	{
		BYTE PECU_call1_6:1;
		BYTE PECU_call2_6:1;
		BYTE PECU_call3_6:1;
		BYTE PECU_call4_6:1;
		BYTE PECU_call1_5:1;
		BYTE PECU_call2_5:1;
		BYTE PECU_call3_5:1;
		BYTE PECU_call4_5:1;
	}car5_6_pecu_call_t;
	struct
	{
		BYTE PECU_act1_3:1;
		BYTE PECU_act2_3:1;
		BYTE PECU_act3_3:1;
		BYTE PECU_act4_3:1;
		BYTE res9:4;
	}car3_pecu_act_t;
	struct
	{
		BYTE PECU_act1_1:1;
		BYTE PECU_act2_1:1;
		BYTE PECU_act3_1:1;
		BYTE PECU_act4_1:1;
		BYTE PECU_act1_2:1;
		BYTE PECU_act2_2:1;
		BYTE PECU_act3_2:1;
		BYTE PECU_act4_2:1;
	}car1_2_pecu_act_t;
	struct
	{
		BYTE PECU_act1_4:1;
		BYTE PECU_act2_4:1;
		BYTE PECU_act3_4:1;
		BYTE PECU_act4_4:1;
		BYTE res10:4;
	}car4_pecu_act_t;
	struct
	{
		BYTE PECU_act1_5:1;
		BYTE PECU_act2_5:1;
		BYTE PECU_act3_5:1;
		BYTE PECU_act4_5:1;
		BYTE PECU_act1_6:1;
		BYTE PECU_act2_6:1;
		BYTE PECU_act3_6:1;
		BYTE PECU_act4_6:1;
	}car5_6_pecu_act_t;
	BYTE Cbk_start_station_ID_h;
	BYTE Cbk_start_station_ID_l;
	BYTE Cbk_end_Station_ID_h;
	BYTE Cbk_end_Station_ID_l;
	BYTE Cbk_current_station_ID_h;
	BYTE Cbk_current_station_ID_l;
	BYTE Cbk_line_ID_h;
	BYTE Cbk_line_ID_l;
	BYTE Cbk_route_ID_h;
	BYTE Cbk_route_ID_l;
	BYTE Heartbeat_h;
	BYTE Heartbeat_l;	//32
#else
	struct
	{
		BYTE Serious_fault:1;
		BYTE General_failure:1;
		BYTE Minor_fault:1;
		BYTE res2:5;
	}fault_level_t;	//1
	BYTE res1;
	struct
	{
		BYTE AC_1:1;		//总的ACSU
		BYTE AC_6:1;
		BYTE PA_1:1;		//总的PACU
		BYTE PA_2:1;
		BYTE PA_3:1;
		BYTE PA_4:1;
		BYTE PA_5:1;
		BYTE PA_6:1;
	}cu_failt_t;	//3
	struct
	{
		BYTE ACSU1:1;		//总的ACSU通信故障
		BYTE ACSU6:1;
		BYTE PACU1:1;		//总的PACU通信故障
		BYTE PACU2:1;
		BYTE PACU3:1;
		BYTE PACU4:1;
		BYTE PACU5:1;
		BYTE PACU6:1;
	}comm_failt_t;
	struct
	{
		BYTE PECU_comm_1_1:1;
		BYTE PECU_comm_2_1:1;
		BYTE PECU_comm_3_1:1;
		BYTE PECU_comm_4_1:1;
		BYTE PECU_comm_1_2:1;
		BYTE PECU_comm_2_2:1;
		BYTE PECU_comm_3_2:1;
		BYTE PECU_comm_4_2:1;
	}car1_2_comm_error_t;	//5
	struct
	{
		BYTE PECU_comm_1_3:1;	//3车PECU1通讯错误
		BYTE PECU_comm_2_3:1;
		BYTE PECU_comm_3_3:1;
		BYTE PECU_comm_4_3:1;
		BYTE res3:4;
	}car3_comm_error_t;
	struct
	{
		BYTE PECU_comm_1_6:1;
		BYTE PECU_comm_2_6:1;
		BYTE PECU_comm_3_6:1;
		BYTE PECU_comm_4_6:1;
		BYTE PECU_comm_1_5:1;
		BYTE PECU_comm_2_5:1;
		BYTE PECU_comm_3_5:1;
		BYTE PECU_comm_4_5:1;
	}car5_6_comm_error_t;	//7
	struct
	{
		BYTE PECU_comm_1_4:1;	//4车PECU1通讯错误
		BYTE PECU_comm_2_4:1;
		BYTE PECU_comm_3_4:1;
		BYTE PECU_comm_4_4:1;
		BYTE res4:4;
	}car4_comm_error_t;
	BYTE res5[2];	//10
	struct
	{
		BYTE CRCK_Master	:1;	//ACSU主控
		BYTE CRCK_Slave		:1;	//ACSU副控
		BYTE PA_active		:1; 
		BYTE Cab_to_PA		:1;	//人工
		BYTE Radio_to_PA	:1;	//OCC
		BYTE Cab_to_Cab		:1;
		BYTE Drive_to_PECU	:1; //紧急对讲
		BYTE Emc_announce_activated:1;//紧急对讲激活
	}acsu_info_t;	//11
	struct
	{
		BYTE res6			:5;
		BYTE auto_mode		:1;		//自动模式
		BYTE semi_auto_mode	:1;		//半自动模式
		BYTE manual_mode	:1;		//手动模式
	}select_mode_t;
	struct
	{
		BYTE PECU_call1_1:1;
		BYTE PECU_call2_1:1;
		BYTE PECU_call3_1:1;
		BYTE PECU_call4_1:1;
		BYTE PECU_call1_2:1;
		BYTE PECU_call2_2:1;
		BYTE PECU_call3_2:1;
		BYTE PECU_call4_2:1;
	}car1_2_pecu_call_t;	//13
	struct
	{
		BYTE PECU_call1_3:1;	//3车PECU1呼叫
		BYTE PECU_call2_3:1;
		BYTE PECU_call3_3:1;
		BYTE PECU_call4_3:1;
		BYTE res7:4;
	}car3_pecu_call_t;		//14
	struct
	{
		BYTE PECU_call1_6:1;
		BYTE PECU_call2_6:1;
		BYTE PECU_call3_6:1;
		BYTE PECU_call4_6:1;
		BYTE PECU_call1_5:1;
		BYTE PECU_call2_5:1;
		BYTE PECU_call3_5:1;
		BYTE PECU_call4_5:1;
	}car5_6_pecu_call_t;	//15
	struct
	{
		BYTE PECU_call1_4:1;	//4车PECU1呼叫
		BYTE PECU_call2_4:1;
		BYTE PECU_call3_4:1;
		BYTE PECU_call4_4:1;
		BYTE res8:4;
	}car4_pecu_call_t;	//16
	struct
	{
		BYTE PECU_act1_1:1;
		BYTE PECU_act2_1:1;
		BYTE PECU_act3_1:1;
		BYTE PECU_act4_1:1;
		BYTE PECU_act1_2:1;
		BYTE PECU_act2_2:1;
		BYTE PECU_act3_2:1;
		BYTE PECU_act4_2:1;
	}car1_2_pecu_act_t;
	struct
	{
		BYTE PECU_act1_3:1;
		BYTE PECU_act2_3:1;
		BYTE PECU_act3_3:1;
		BYTE PECU_act4_3:1;
		BYTE res9:4;
	}car3_pecu_act_t;	//18
	struct
	{
		BYTE PECU_act1_6:1;
		BYTE PECU_act2_6:1;
		BYTE PECU_act3_6:1;
		BYTE PECU_act4_6:1;
		BYTE PECU_act1_5:1;
		BYTE PECU_act2_5:1;
		BYTE PECU_act3_5:1;
		BYTE PECU_act4_5:1;
	}car6_5_pecu_act_t;
	struct
	{
		BYTE PECU_act1_4:1;
		BYTE PECU_act2_4:1;
		BYTE PECU_act3_4:1;
		BYTE PECU_act4_4:1;
		BYTE res10:4;
	}car4_pecu_act_t;				//20

	BYTE Cbk_start_station_ID_l;
	BYTE Cbk_start_station_ID_h;
	BYTE Cbk_end_Station_ID_l;
	BYTE Cbk_end_Station_ID_h;
	BYTE Cbk_current_station_ID_l;
	BYTE Cbk_current_station_ID_h;	//26
	BYTE Cbk_line_ID_l;
	BYTE Cbk_line_ID_h;
	BYTE Cbk_route_ID_l;
	BYTE Cbk_route_ID_h;
	BYTE Heartbeat_l;
	BYTE Heartbeat_h;				//32
#endif
}PA_DIAGNOSE_STATUS_180H_T;

typedef struct
{
#if BIG_ENDIAN_181H
	BYTE acsu1_version_h;   // 1 
	BYTE acsu1_version_l;   // 2 

	BYTE acsu6_version_h;   // 3 
	BYTE acsu6_version_l;   // 4 

	BYTE pacu1_version_h;   // 5
	BYTE pacu1_version_l;   // 6 

	BYTE pacu2_version_h;   // 7
	BYTE pacu2_version_l;   // 8 

	BYTE pacu3_version_h;   // 9 
	BYTE pacu3_version_l;   // 10 

	BYTE pacu4_version_h;   // 11
	BYTE pacu4_version_l;   // 12 

	BYTE pacu5_version_h;   // 13 
	BYTE pacu5_version_l;   // 14 

	BYTE pacu6_version_h;   // 15 
	BYTE pacu6_version_l;   // 16 

	BYTE reserve1[16];      // 17-32 
#else 
	BYTE acsu1_version_l;   // 2 
	BYTE acsu1_version_h;   // 1 

	BYTE acsu6_version_l;   // 4 
	BYTE acsu6_version_h;   // 3 

	BYTE pacu1_version_l;   // 6 
	BYTE pacu1_version_h;   // 5

	BYTE pacu2_version_l;   // 8 
	BYTE pacu2_version_h;   // 7

	BYTE pacu3_version_l;   // 10 
	BYTE pacu3_version_h;   // 9 

	BYTE pacu4_version_l;   // 12 
	BYTE pacu4_version_h;   // 11

	BYTE pacu5_version_l;   // 14 
	BYTE pacu5_version_h;   // 13 

	BYTE pacu6_version_l;   // 16 
	BYTE pacu6_version_h;   // 15 

	BYTE reserve1[16];      // 17-32 
#endif
}PA_VER_181H_T;

typedef struct
{
#if BIG_ENDIAN_182H
	BYTE res1;
	struct
	{
		BYTE tc1_monitoring_fault:1;
		BYTE tc2_monitoring_fault:1;
		BYTE tc1_media_fault:1;
		BYTE tc2_media_fault:1;
		BYTE tc1_ipc_fault:1;
		BYTE tc2_ipc_fault:1;
		BYTE res2:2;
	}tc_fault_t;
	BYTE res3;
	struct
	{
		BYTE res4:2;
		BYTE a1_ipc1_fault:1;
		BYTE a1_ipc2_fault:1;
		BYTE a1_ipc3_fault:1;
		BYTE b1_ipc1_fault:1;
		BYTE b1_ipc2_fault:1;
		BYTE b1_ipc3_fault:1;
	}a1_b1_ipc_fault_t;
	BYTE res5;
	struct
	{
		BYTE res6:2;
		BYTE c1_ipc1_fault:1;
		BYTE c1_ipc2_fault:1;
		BYTE c1_ipc3_fault:1;
		BYTE c2_ipc1_fault:1;
		BYTE c2_ipc2_fault:1;
		BYTE c2_ipc3_fault:1;
	}c1_c2_ipc_fault_t;
	BYTE res7;
	struct
	{
		BYTE res8:2;
		BYTE b2_ipc1_fault:1;
		BYTE b2_ipc2_fault:1;
		BYTE b2_ipc3_fault:1;
		BYTE a2_ipc1_fault:1;
		BYTE a2_ipc2_fault:1;
		BYTE a2_ipc3_fault:1;
	}b2_a2_ipc_fault_t;
	BYTE monitoring_sw_ver_2;
	BYTE monitoring_sw_ver_1;
	BYTE res9;
	BYTE monitoring_sw_ver_3;
	BYTE media_sw_ver_2;
	BYTE media_sw_ver_1;
	BYTE media_volume;
	BYTE media_sw_ver_3;
#else
	struct
	{
		BYTE tc1_monitoring_fault:1;
		BYTE tc2_monitoring_fault:1;
		BYTE tc1_media_fault:1;
		BYTE tc2_media_fault:1;
		BYTE tc1_ipc_fault:1;
		BYTE tc2_ipc_fault:1;
		BYTE res2:2;
	}tc_fault_t;	//1
	BYTE res1;	//2
	struct
	{
		BYTE res4:2;
		BYTE a1_ipc1_fault:1;
		BYTE a1_ipc2_fault:1;
		BYTE a1_ipc3_fault:1;
		BYTE b1_ipc1_fault:1;
		BYTE b1_ipc2_fault:1;
		BYTE b1_ipc3_fault:1;
	}a1_b1_ipc_fault_t;	//3
	BYTE res3;	//4
	struct
	{
		BYTE res6:2;
		BYTE c1_ipc1_fault:1;
		BYTE c1_ipc2_fault:1;
		BYTE c1_ipc3_fault:1;
		BYTE c2_ipc1_fault:1;
		BYTE c2_ipc2_fault:1;
		BYTE c2_ipc3_fault:1;
	}c1_c2_ipc_fault_t;	//5
	BYTE res5;
	struct
	{
		BYTE res8:2;
		BYTE b2_ipc1_fault:1;
		BYTE b2_ipc2_fault:1;
		BYTE b2_ipc3_fault:1;
		BYTE a2_ipc1_fault:1;
		BYTE a2_ipc2_fault:1;
		BYTE a2_ipc3_fault:1;
	}b2_a2_ipc_fault_t;	//7
	BYTE res7;	//8
	BYTE monitoring_sw_ver_1;
	BYTE monitoring_sw_ver_2;
	BYTE monitoring_sw_ver_3;
	BYTE res9;	//12
	BYTE media_sw_ver_1;
	BYTE media_sw_ver_2;
	BYTE media_sw_ver_3;
	BYTE media_volume;	//16
#endif
}TV_DIAGNOSE_VER_182H_T;

typedef struct 
{ 
	BYTE fram_begin;   // 0 0xFE 

	/******PA诊断和状态数据端口 180H  Len:32******/ 
	PA_DIAGNOSE_STATUS_180H_T pa_status_t;           // 1-32 

	/******PA版本数据端口 181H  Len:32******/ 
	PA_VER_181H_T pa_ver_t;							 // 33-64 

	/******TV诊断和版本数据端口 182H  Len:16******/ 
	TV_DIAGNOSE_VER_182H_T tv_ver_t;				 // 65-80

	BYTE checksum;									 //  81
	BYTE fram_end;									 //  82 0xFF    
}tms_recv_packet_t;


static void OnRefreshFeedbackPanel()
{
	char szCarTxt[24][32]={_T("严重故障"),_T("一般故障"),_T("轻微故障"),_T("监控软件版本号"),_T("媒体软件版本"),_T("媒体主机音量"),//6
		_T("TC1监控主机故障"),_T("TC1媒体主机故障"),_T("TC1司机摄像头故障"),_T("TC2监控主机故障"),_T("TC2媒体主机故障"),_T("TC2司机摄像头故障"),//6
		_T("ACSU主控"),_T("ACSU 副控"),_T("PA功能激活"),_T("人工广播"),_T("OCC 广播"),_T("司机对讲"),//6
		_T("紧急对讲"),_T("紧急对讲激活"),_T("全自动模式"),_T("半自动模式"),_T("手动模式")};//5

	char szAcsuTxt[6][32]={_T("1车ACSU故障"), _T("6车ACSU故障"), _T("ACSU1通讯故障"), _T("ACSU6通讯故障"), _T("ACSU1版本:"), _T("ACSU版本6:")};//6

	char szTitlTxt[6][32]={_T("A1 车"), _T("B1 车"), _T("C1 车"), _T("C2 车"), _T("B2 车"), _T("A2 车")};//6

	char szTxt[20][32]={_T("PACU故障"),//1
		_T("PACU通讯故障"),
		_T("摄像头1故障"), _T("摄像头2故障"), _T("摄像头3故障"), //4
		_T("PACU版本:"),//1
		_T("PECU通讯-1"), _T("PECU通讯-2"), _T("PECU通讯-3"),_T("PECU通讯-4"),//4
		_T("PECU呼叫-1"), _T("PECU呼叫-2"), _T("PECU呼叫-3"), _T("PECU呼叫-4"),//4
